Revit 2027 API
Wire.WiringType Property
 The wiring type(arc or chamfer) for the wire.
Namespace: Autodesk.Revit.DB.Electrical
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public WiringType WiringType { get; set; }
Public Property WiringType As WiringType
	Get
	Set
public:
property WiringType WiringType {
	WiringType get ();
	void set (WiringType value);
}
member WiringType : WiringType with get, set
Property Value
WiringType
Exceptions
Exception | Condition
ArgumentOutOfRangeException |  When setting this property: A value passed for an enumeration argument is not a member of that enumeration
Remarks
 If the WiringType is arc, the shape of the wire depends on the number of points - it may be linear, a circular arc, or a spline.
See Also
Reference
Wire Class
Autodesk.Revit.DB.Electrical Namespace